;; theme-packages
(package! catppuccin-theme)

;; tabs-packages
(package! centaur-tabs)

;; company-packages
(package! company-box)
(package! company-dict)
(package! company-mode)

;; vertico-packages
(package! all-the-icons-completion)
(package! consult)
(package! embark)
(package! embark-consult)
(package! marginalia)
(package! orderless)
(package! vertico)
(package! wgrep)

;; treemacs-packages
(package! treemacs)
(package! treemacs-projectile)
(package! treemacs-evil)
(package! treemacs-magit)
(package! lsp-treemacs)

;; dired-packages
(package! all-the-icons-dired)
(package! diff-hl)
(package! diredfl)
(package! dired-rsync)
(package! fd-dired)

;; org-packages
(package! htmlize)
(package! ob-async)
(package! org-cliplink)
(package! orgit)
(package! org)
(package! org-contrib)
(package! ox-clip)
(package! evil-org)
(package! org-pdftools)
(package! org-download)
(package! gnuplot)
(package! gnuplot-mode)
(package! ob-ipython)
(package! jupyter)
(package! org-roam)
(package! org-noter)
(package! org-modern)
(package! org-appear)
(package! all-the-icons)
(package! org-super-agenda)

;; python-packages
(package! anaconda-mode)
(package! conda)
(package! pip-requirements)
(package! poetry)
(package! cython-mode)
(package! flycheck-cython)
(package! lsp-pyright)
(package! python-black)

;; application-packages
(package! app-launcher :recipe (:host github :repo "SebastienWae/app-launcher"))
(package! pdf-tools)

;; docker-packages
(package! docker)
(package! dockerfile-mode)
